Revit 2025 API
ParameterTypeId.RebarFreeFormHookStartPlaneAngle Property
 "Hook Orientation At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarFreeFormHookStartPlaneAngle { get; }
Public Shared ReadOnly Property RebarFreeFormHookStartPlaneAngle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarFreeFormHookStartPlaneAngle {
	ForgeTypeId^ get ();
}
static member RebarFreeFormHookStartPlaneAngle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace